# Pandas

In [31]:
import pandas as pd
import numpy as np

In [33]:
np.linspace(2, 8, 6)

array([2. , 3.2, 4.4, 5.6, 6.8, 8. ])

## Series

In [4]:
nota = pd.Series([12, 7, 14, 16], index = ['Luis', 'Pedro', 'Jesus', 'Maria']) # dtype = 'int32'
nota

Luis     12
Pedro     7
Jesus    14
Maria    16
dtype: int64

In [35]:
nota2 = pd.Series(np.linspace(12, 17, 4), index = ['Luis', 'Pedro', 'Jesus', 'Maria']) # dtype = 'int32'
nota2

Luis     12.000000
Pedro    13.666667
Jesus    15.333333
Maria    17.000000
dtype: float64

In [36]:
x = np.linspace(12, 17, 4)
nota3 = pd.Series(x)
nota3

0    12.000000
1    13.666667
2    15.333333
3    17.000000
dtype: float64

In [37]:
x = {'Luis': 9, 'Pedro': 12}
nota4 = pd.Series(x)
nota4

Luis      9
Pedro    12
dtype: int64

In [38]:
x = {'Luis': 9, 'Pedro': 12}
nota5 = pd.Series(x, index = ['Luis', 'Pedro', 'Jesus', 'Maria'])
nota5

Luis      9.0
Pedro    12.0
Jesus     NaN
Maria     NaN
dtype: float64

In [39]:
nota6 = pd.Series(10, index = ['Luis', 'Pedro', 'Jesus', 'Maria'])
nota6

Luis     10
Pedro    10
Jesus    10
Maria    10
dtype: int64

In [5]:
nota[0]

12

In [6]:
nota['Luis']

12

In [7]:
nota.dtype

dtype('int64')

In [8]:
nota.index

Index(['Luis', 'Pedro', 'Jesus', 'Maria'], dtype='object')

In [9]:
nota.values

array([12,  7, 14, 16], dtype=int64)

In [11]:
nota.name = "SPS 2020"
nota.name

'SPS 2020'

In [12]:
nota

Luis     12
Pedro     7
Jesus    14
Maria    16
Name: SPS 2020, dtype: int64

In [13]:
nota.index.name = 'Alumnos'
nota

Alumnos
Luis     12
Pedro     7
Jesus    14
Maria    16
Name: SPS 2020, dtype: int64

In [14]:
nota.axes

[Index(['Luis', 'Pedro', 'Jesus', 'Maria'], dtype='object', name='Alumnos')]

In [15]:
nota.shape

(4,)

In [18]:
nota.astype('int32')

Alumnos
Luis     12
Pedro     7
Jesus    14
Maria    16
Name: SPS 2020, dtype: int32

In [19]:
nota.dtype

dtype('int64')

## DataFrame

In [73]:
nota = pd.DataFrame({"Calculo": [12, 14, 7, 16],
                     "Control": [10, 6, 4, 8],
                     "Numericos": [16, 12, 11, 20],
                     "Apobado": ['Si', 'Si', 'No', 'Si']
                    },
                    index = ['Luis', 'Pedro', 'Jesus', 'Maria']
                   )
nota

       Calculo  Control  Numericos Apobado
Luis        12       10         16      Si
Pedro       14        6         12      Si
Jesus        7        4         11      No
Maria       16        8         20      Si

In [41]:
nota2 = pd.DataFrame({"Calculo": [12, 14, 7, 16],
                     "Control": [10, 6, 4, 8],
                     "Numericos": [16, 12, 11, 20],
                     "Apobado": ['Si', 'Si', 'No', 'Si']
                    },
                    index = ['Luis', 'Pedro', 'Jesus', 'Maria'],
                    columns = ['Basicas', 'Fisica', 'Tele', 'Aprobado']
                   )
nota2

      Basicas Fisica Tele Aprobado
Luis      NaN    NaN  NaN      NaN
Pedro     NaN    NaN  NaN      NaN
Jesus     NaN    NaN  NaN      NaN
Maria     NaN    NaN  NaN      NaN

In [50]:
matrix = np.array([[1, 2, 3, 4],
                  [4, 5, 6, 7],
                  [7, 8, 9, 10],
                  [10, 11, 12, 13]])
matrix

array([[ 1,  2,  3,  4],
       [ 4,  5,  6,  7],
       [ 7,  8,  9, 10],
       [10, 11, 12, 13]])

In [51]:
nota3 = pd.DataFrame(matrix)
nota3

    0   1   2   3
0   1   2   3   4
1   4   5   6   7
2   7   8   9  10
3  10  11  12  13

In [53]:
nota3 = pd.DataFrame(matrix, 
                     index = ['Luis', 'Pedro', 'Jesus', 'Maria'],
                     columns = ['Basicas', 'Fisica', 'Tele', 'Aprobado'])
nota3

       Basicas  Fisica  Tele  Aprobado
Luis         1       2     3         4
Pedro        4       5     6         7
Jesus        7       8     9        10
Maria       10      11    12        13

In [57]:
luis = {"Basicas": 1, "Fisica": 2, "Tele":3}
jose = {"Basicas": 1, "Fisica": 2, "Tele": 4}
maria = {"Basicas": 1, "Fisica": 2, "Tele":5}

nota4 = pd.DataFrame([luis, jose, maria],
                     index = ['Luis', 'Jose', 'Maria'])
nota4

       Basicas  Fisica  Tele
Luis         1       2     3
Jose         1       2     4
Maria        1       2     5

In [58]:
luis = {"Basicas": 1, "Fisica": 2, "Tele":3}
jose = {"Basicas": 1, "Fisica": 2, "Tele": 4}
maria = {"Basicas": 1, "Fisica": 2, "Tele":5, "Control": 6}

nota5 = pd.DataFrame([luis, jose, maria],
                     index = ['Luis', 'Jose', 'Maria'])
nota5

       Basicas  Fisica  Tele  Control
Luis         1       2     3      NaN
Jose         1       2     4      NaN
Maria        1       2     5      6.0

In [23]:
nota.dtypes

Calculo       int64
Control       int64
Numericos     int64
Apobado      object
dtype: object

In [24]:
nota.index

Index(['Luis', 'Pedro', 'Jesus', 'Maria'], dtype='object')

In [25]:
nota.columns

Index(['Calculo', 'Control', 'Numericos', 'Apobado'], dtype='object')

In [26]:
nota.axes

[Index(['Luis', 'Pedro', 'Jesus', 'Maria'], dtype='object'),
 Index(['Calculo', 'Control', 'Numericos', 'Apobado'], dtype='object')]

In [27]:
nota.index.name = 'Cursos'
nota.columns.name = 'Alumnos'
nota

Alumnos  Calculo  Control  Numericos Apobado
Cursos
Luis          12       10         16      Si
Pedro         14        6         12      Si
Jesus          7        4         11      No
Maria         16        8         20      Si

In [28]:
nota.values

array([[12, 10, 16, 'Si'],
       [14, 6, 12, 'Si'],
       [7, 4, 11, 'No'],
       [16, 8, 20, 'Si']], dtype=object)

In [29]:
nota.shape

(4, 4)

head

tail

sample

In [59]:
dias = pd.Series([31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31],
            index = ["ene", "feb", "mar", "abr", "may", "jun", "jul", "ago",
             "sep", "oct", "nov", "dic"])
dias

ene    31
feb    28
mar    31
abr    30
may    31
jun    30
jul    31
ago    31
sep    30
oct    31
nov    30
dic    31
dtype: int64

In [60]:
dias.head()

ene    31
feb    28
mar    31
abr    30
may    31
dtype: int64

In [61]:
dias.tail()

ago    31
sep    30
oct    31
nov    30
dic    31
dtype: int64

In [69]:
dias.sample(4)

may    31
mar    31
jun    30
ene    31
dtype: int64

In [80]:
s = pd.Series([3, 1, 2, 1, 1, 4, 1, 2, np.nan])
s

0    3.0
1    1.0
2    2.0
3    1.0
4    1.0
5    4.0
6    1.0
7    2.0
8    NaN
dtype: float64

In [81]:
s.value_counts()

1.0    4
2.0    2
4.0    1
3.0    1
dtype: int64

In [79]:
s.value_counts(dropna = False)

1.0    4
2.0    2
NaN    1
4.0    1
3.0    1
dtype: int64

In [83]:
s.value_counts(bins = 3)

(0.996, 2.0]    6
(3.0, 4.0]      1
(2.0, 3.0]      1
dtype: int64

In [85]:
s[0]

3.0

In [86]:
s[1:3]

1    1.0
2    2.0
dtype: float64

In [87]:
s[[5,3]]

5    4.0
3    1.0
dtype: float64

In [90]:
s.get(5)

4.0

In [91]:
s.loc[[5,3]]

5    4.0
3    1.0
dtype: float64

In [95]:
s.iloc[-2]

2.0

In [96]:
s.iloc[[5,3]]

5    4.0
3    1.0
dtype: float64

In [97]:
s.iloc[3:6]

3    1.0
4    1.0
5    4.0
dtype: float64

In [98]:
s[s > 2]

0    3.0
5    4.0
dtype: float64

In [74]:
nota.sample(2)

       Calculo  Control  Numericos Apobado
Luis        12       10         16      Si
Maria       16        8         20      Si

In [75]:
nota.describe()

        Calculo    Control  Numericos
count   4.00000   4.000000   4.000000
mean   12.25000   7.000000  14.750000
std     3.86221   2.581989   4.112988
min     7.00000   4.000000  11.000000
25%    10.75000   5.500000  11.750000
50%    13.00000   7.000000  14.000000
75%    14.50000   8.500000  17.000000
max    16.00000  10.000000  20.000000

In [77]:
nota.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Luis to Maria
Data columns (total 4 columns):
Calculo      4 non-null int64
Control      4 non-null int64
Numericos    4 non-null int64
Apobado      4 non-null object
dtypes: int64(3), object(1)
memory usage: 160.0+ bytes

In [99]:
nota['Calculo'].value_counts()

7     1
14    1
12    1
16    1
Name: Calculo, dtype: int64